#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Validation `success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

module.test.module.gke.random_string.cluster_service_account_suffix: Refreshing state... [id=65l3]
module.test.data.google_client_config.default: Reading...
module.test.module.gke.data.google_compute_zones.available: Reading...
module.test.google_service_account.example: Refreshing state... [id=projects/cq-provider-gcp/serviceAccounts/cq-example-gke-service-account@cq-provider-gcp.iam.gserviceaccount.com]
module.test.module.gke.google_service_account.cluster_service_account[0]: Refreshing state... [id=projects/cq-provider-gcp/serviceAccounts/tf-gke-cq-example-gke--65l3@cq-provider-gcp.iam.gserviceaccount.com]
module.test.module.gke.data.google_container_engine_versions.region: Reading...
module.test.module.gcp-network.module.vpc.google_compute_network.network: Refreshing state... [id=projects/cq-provider-gcp/global/networks/cq-example-gke-cluster-network]
module.test.data.google_client_config.default: Read complete after 1s [id=projects/cq-provider-gcp/regions/us-east1/zones/]
module.test.module.gke.google_project_iam_member.cluster_service_account-log_writer[0]: Refreshing state... [id=cq-provider-gcp/roles/logging.logWriter/serviceAccount:tf-gke-cq-example-gke--65l3@cq-provider-gcp.iam.gserviceaccount.com]
module.test.module.gke.data.google_container_engine_versions.region: Read complete after 1s [id=2022-05-23 16:06:25.080583414 +0000 UTC]
module.test.module.gcp-network.module.subnets.google_compute_subnetwork.subnetwork["us-east1/cq-example-gke-cluster-master-subnet"]: Refreshing state... [id=projects/cq-provider-gcp/regions/us-east1/subnetworks/cq-example-gke-cluster-master-subnet]
module.test.module.gcp-network.module.subnets.google_compute_subnetwork.subnetwork["us-east1/cq-example-gke-cluster-subnet"]: Refreshing state... [id=projects/cq-provider-gcp/regions/us-east1/subnetworks/cq-example-gke-cluster-subnet]
module.test.module.gke.data.google_compute_zones.available: Read complete after 1s [id=projects/cq-provider-gcp/regions/us-east1]
module.test.module.gke.random_shuffle.available_zones: Refreshing state... [id=-]
module.test.module.gke.data.google_container_engine_versions.zone: Reading...
module.test.module.gke.data.google_compute_subnetwork.gke_subnetwork[0]: Reading...
module.test.module.gke.google_project_iam_member.cluster_service_account-metric_writer[0]: Refreshing state... [id=cq-provider-gcp/roles/monitoring.metricWriter/serviceAccount:tf-gke-cq-example-gke--65l3@cq-provider-gcp.iam.gserviceaccount.com]
module.test.module.gke.data.google_container_engine_versions.zone: Read complete after 0s [id=2022-05-23 16:06:25.470127462 +0000 UTC]
module.test.module.gke.data.google_compute_subnetwork.gke_subnetwork[0]: Read complete after 0s [id=projects/cq-provider-gcp/regions/us-east1/subnetworks/cq-example-gke-cluster-subnet]
module.test.module.gke.google_container_cluster.primary: Refreshing state... [id=projects/cq-provider-gcp/locations/us-east1/clusters/cq-example-gke-cluster]
module.test.module.gke.google_project_iam_member.cluster_service_account-monitoring_viewer[0]: Refreshing state... [id=cq-provider-gcp/roles/monitoring.viewer/serviceAccount:tf-gke-cq-example-gke--65l3@cq-provider-gcp.iam.gserviceaccount.com]
module.test.module.gke.google_project_iam_member.cluster_service_account-resourceMetadata-writer[0]: Refreshing state... [id=cq-provider-gcp/roles/stackdriver.resourceMetadata.writer/serviceAccount:tf-gke-cq-example-gke--65l3@cq-provider-gcp.iam.gserviceaccount.com]
module.test.module.gke.google_compute_firewall.intra_egress[0]: Refreshing state... [id=projects/cq-provider-gcp/global/firewalls/gke-cq-example-gke-cluster-intra-cluster-egress]
module.test.module.gke.google_container_node_pool.pools["cq-example-gke-pool-1"]: Refreshing state... [id=projects/cq-provider-gcp/locations/us-east1/clusters/cq-example-gke-cluster/nodePools/cq-example-gke-pool-1]
module.test.module.gke.google_compute_firewall.master_webhooks[0]: Refreshing state... [id=projects/cq-provider-gcp/global/firewalls/gke-cq-example-gke-cluster-webhooks]
module.test.module.gke.google_container_node_pool.pools["default-node-pool"]: Refreshing state... [id=projects/cq-provider-gcp/locations/us-east1/clusters/cq-example-gke-cluster/nodePools/default-node-pool]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.test.module.gke.google_container_cluster.primary has changed
  ~ resource "google_container_cluster" "primary" {
        id                          = "projects/cq-provider-gcp/locations/us-east1/clusters/cq-example-gke-cluster"
        name                        = "cq-example-gke-cluster"
      + resource_labels             = {}
        # (26 unchanged attributes hidden)












      + node_pool {
          + initial_node_count          = 1
          + instance_group_urls         = [
              + "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/zones/us-east1-b/instanceGroupManagers/gke-cq-example-gke-c-default-node-poo-67da3eb4-grp",
              + "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/zones/us-east1-c/instanceGroupManagers/gke-cq-example-gke-c-default-node-poo-290fc937-grp",
            ]
          + managed_instance_group_urls = [
              + "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/zones/us-east1-b/instanceGroups/gke-cq-example-gke-c-default-node-poo-67da3eb4-grp",
              + "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/zones/us-east1-c/instanceGroups/gke-cq-example-gke-c-default-node-poo-290fc937-grp",
            ]
          + max_pods_per_node           = 110
          + name                        = "default-node-pool"
          + node_count                  = 1
          + node_locations              = [
              + "us-east1-b",
              + "us-east1-c",
            ]
          + version                     = "1.23.6-gke.1500"

          + autoscaling {
              + max_node_count = 2
              + min_node_count = 1
            }

          + management {
              + auto_repair  = true
              + auto_upgrade = true
            }

          + node_config {
              + disk_size_gb      = 10
              + disk_type         = "pd-standard"
              + guest_accelerator = []
              + image_type        = "COS_CONTAINERD"
              + labels            = {
                  + "cluster_name"      = "cq-example-gke-cluster"
                  + "default-node-pool" = "true"
                  + "node_pool"         = "default-node-pool"
                }
              + local_ssd_count   = 0
              + machine_type      = "e2-micro"
              + metadata          = {
                  + "cluster_name"                    = "cq-example-gke-cluster"
                  + "disable-legacy-endpoints"        = "true"
                  + "node-pool-metadata-custom-value" = "my-node-pool"
                  + "node_pool"                       = "default-node-pool"
                }
              + oauth_scopes      = [
                  + "https://www.googleapis.com/auth/cloud-platform",
                ]
              + preemptible       = true
              + service_account   = "cq-example-gke-service-account@cq-provider-gcp.iam.gserviceaccount.com"
              + tags              = [
                  + "gke-cq-example-gke-cluster",
                  + "gke-cq-example-gke-cluster-default-node-pool",
                  + "default-node-pool",
                ]
              + taint             = [
                  + {
                      + effect = "PREFER_NO_SCHEDULE"
                      + key    = "default-node-pool"
                      + value  = "true"
                    },
                ]

              + gcfs_config {
                  + enabled = false
                }

              + shielded_instance_config {
                  + enable_integrity_monitoring = true
                  + enable_secure_boot          = false
                }

              + workload_metadata_config {
                  + mode = "GKE_METADATA"
                }
            }

          + upgrade_settings {
              + max_surge       = 1
              + max_unavailable = 0
            }
        }
      + node_pool {
          + initial_node_count          = 1
          + instance_group_urls         = [
              + "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/zones/us-east1-c/instanceGroupManagers/gke-cq-example-gke-c-cq-example-gke-p-5d35a805-grp",
            ]
          + managed_instance_group_urls = [
              + "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/zones/us-east1-c/instanceGroups/gke-cq-example-gke-c-cq-example-gke-p-5d35a805-grp",
            ]
          + max_pods_per_node           = 110
          + name                        = "cq-example-gke-pool-1"
          + node_count                  = 1
          + node_locations              = [
              + "us-east1-c",
            ]
          + version                     = "1.23.6-gke.1500"

          + autoscaling {
              + max_node_count = 1
              + min_node_count = 1
            }

          + management {
              + auto_repair  = true
              + auto_upgrade = true
            }

          + node_config {
              + disk_size_gb      = 10
              + disk_type         = "pd-standard"
              + guest_accelerator = []
              + image_type        = "COS_CONTAINERD"
              + labels            = {
                  + "cluster_name" = "cq-example-gke-cluster"
                  + "node_pool"    = "cq-example-gke-pool-1"
                }
              + local_ssd_count   = 0
              + machine_type      = "e2-micro"
              + metadata          = {
                  + "cluster_name"             = "cq-example-gke-cluster"
                  + "disable-legacy-endpoints" = "true"
                  + "node_pool"                = "cq-example-gke-pool-1"
                }
              + oauth_scopes      = [
                  + "https://www.googleapis.com/auth/logging.write",
                  + "https://www.googleapis.com/auth/monitoring",
                ]
              + preemptible       = true
              + service_account   = "cq-example-gke-service-account@cq-provider-gcp.iam.gserviceaccount.com"
              + tags              = [
                  + "gke-cq-example-gke-cluster",
                  + "gke-cq-example-gke-cluster-cq-example-gke-pool-1",
                ]
              + taint             = []

              + gcfs_config {
                  + enabled = false
                }

              + shielded_instance_config {
                  + enable_integrity_monitoring = true
                  + enable_secure_boot          = false
                }

              + workload_metadata_config {
                  + mode = "GKE_METADATA"
                }
            }

          + upgrade_settings {
              + max_surge       = 1
              + max_unavailable = 0
            }
        }




        # (16 unchanged blocks hidden)
    }

  # module.test.module.gcp-network.module.subnets.google_compute_subnetwork.subnetwork["us-east1/cq-example-gke-cluster-subnet"] has changed
  ~ resource "google_compute_subnetwork" "subnetwork" {
        id                         = "projects/cq-provider-gcp/regions/us-east1/subnetworks/cq-example-gke-cluster-subnet"
        name                       = "cq-example-gke-cluster-subnet"
      ~ private_ip_google_access   = false -> true
        # (11 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.test.module.gke.google_container_node_pool.pools["cq-example-gke-pool-1"] must be replaced
-/+ resource "google_container_node_pool" "pools" {
      ~ id                          = "projects/cq-provider-gcp/locations/us-east1/clusters/cq-example-gke-cluster/nodePools/cq-example-gke-pool-1" -> (known after apply)
      ~ instance_group_urls         = [
          - "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/zones/us-east1-c/instanceGroupManagers/gke-cq-example-gke-c-cq-example-gke-p-5d35a805-grp",
        ] -> (known after apply)
      ~ managed_instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/cq-provider-gcp/zones/us-east1-c/instanceGroups/gke-cq-example-gke-c-cq-example-gke-p-5d35a805-grp",
        ] -> (known after apply)
      ~ max_pods_per_node           = 110 -> (known after apply)
        name                        = "cq-example-gke-pool-1"
      + name_prefix                 = (known after apply)
      ~ node_count                  = 1 -> (known after apply)
      ~ node_locations              = [
          - "us-east1-c",
        ] -> (known after apply)
      + operation                   = (known after apply)
      ~ version                     = "1.23.6-gke.1500" -> (known after apply)
        # (4 unchanged attributes hidden)



      ~ node_config {
          ~ oauth_scopes      = [
              - "https://www.googleapis.com/auth/logging.write",
              - "https://www.googleapis.com/auth/monitoring",
            ] -> (known after apply) # forces replacement
            tags              = [
                "gke-cq-example-gke-cluster",
                "gke-cq-example-gke-cluster-cq-example-gke-pool-1",
            ]
          ~ taint             = [] -> (known after apply)
            # (10 unchanged attributes hidden)



            # (3 unchanged blocks hidden)
        }


      ~ upgrade_settings {
          ~ max_surge       = 1 -> (known after apply)
          ~ max_unavailable = 0 -> (known after apply)
        }
        # (3 unchanged blocks hidden)
    }

  # module.test.module.gcp-network.module.subnets.google_compute_subnetwork.subnetwork["us-east1/cq-example-gke-cluster-subnet"] will be updated in-place
  ~ resource "google_compute_subnetwork" "subnetwork" {
        id                         = "projects/cq-provider-gcp/regions/us-east1/subnetworks/cq-example-gke-cluster-subnet"
        name                       = "cq-example-gke-cluster-subnet"
      ~ private_ip_google_access   = true -> false
        # (11 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"

```

</details>

*Pusher: @erezrokah, Action: `pull_request_target`, Working Directory: ``, Workflow: `terraform_plan`*